//перевірк арідключення
console.log('перевірка підключеного файлу скриптів market.js');



//отримання елементу з індифікатором items
let itemsDiv = document.getElementById("items");

let itemsArray = ['газонокосарка', 'какашка ', 'бублик', 'трубка', 'вода', 'телевізор', 'кнопка ', 'ручка', 'шкаф', 'телефон', 'стілець', 'люстра', 'дзеркало']

//перевірка існування знайденого блоку
if (itemsDiv) {
    itemsArray.forEach((item)=> {
        itemsDiv.innerHTML +='<div class = items></div>'
            }) 


        }else{
    //вивід повідомлення про незнайдений блок
    console.log('блок товарів не знайдено')
}


//Визначення масиву товарів
// let itemsArray = ['газонокосарка', 'какашка ', 'бублик', 'трубка', 'вода', 'телевізор', 'кнопка ', 'ручка', 'шкаф', 'телефон', 'стілець', 'люстра', 'дзеркало']

console.log(itemsArray)



// Виведемо в консоль елементів масиву
for (let i = 0; i < itemsArray.length; i++) {
    console.log(itemsArray[i])
}

